In [8]:
import pandas as pd
import psycopg2
import urllib.parse
from sqlalchemy import create_engine

password = urllib.parse.quote_plus("@Woodlandscollege7696")
engine = create_engine(f'postgresql://postgres:{password}@localhost/postgres')

def get_connection():
    return psycopg2.connect(
        host = "localhost",
        database = "postgres",
        password = "@Woodlandscollege7696",
        user = "postgres"
        )

In [9]:
CENSUS_DATA = pd.read_csv(r"C:\Users\danie\OneDrive\Kaggle\ChicagoCensusData.csv")
CENSUS_DATA.to_sql("CENSUS_DATA", engine, if_exists='replace', index=False)

78

In [15]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute('''
            CREATE OR REPLACE VIEW "CENSUS_DATA_RESTRICTED"
            AS SELECT "COMMUNITY_AREA_NUMBER", "COMMUNITY_AREA_NAME", "PER_CAPITA_INCOME", "HARDSHIP_INDEX"
            FROM "CENSUS_DATA"
        ''')

In [19]:
View_the_view = pd.read_sql_query("""SELECT * FROM "CENSUS_DATA_RESTRICTED" """, engine)
View_the_view.head(len(View_the_view))

,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,PER_CAPITA_INCOME,HARDSHIP_INDEX
0,1.0,Rogers Park,23939,39.0
1,2.0,West Ridge,23040,46.0
2,3.0,Uptown,35787,20.0
3,4.0,Lincoln Square,37524,17.0
4,5.0,North Center,57123,6.0
...,...,...,...,...
73,74.0,Mount Greenwood,34381,16.0
74,75.0,Morgan Park,27149,30.0
75,76.0,O'Hare,25828,24.0
76,77.0,Edgewater,33385,19.0
77,NaN,CHICAGO,28202,NaN

In [23]:
with get_connection() as connection:
    with connection.cursor() as cursor:
        cursor.execute('''
        CREATE OR REPLACE VIEW "VIEW_OF_A_VIEW"
        AS SELECT "COMMUNITY_AREA_NUMBER", "COMMUNITY_AREA_NAME"
        FROM "CENSUS_DATA_RESTRICTED"
        ''')

view_of_a_view = pd.read_sql_query("""SELECT * FROM "VIEW_OF_A_VIEW" """, engine)
view_of_a_view.head()

   COMMUNITY_AREA_NUMBER COMMUNITY_AREA_NAME
0                    1.0         Rogers Park
1                    2.0          West Ridge
2                    3.0              Uptown
3                    4.0      Lincoln Square
4                    5.0        North Center